Revit 2020 API
StructuralConnectionHandler.Create Method
Overload List
Name | Description
Create(Document, IList<ElementId>)
 Creates a new instance of a Structural Connection Handler, which defines the connection between given elements. Elements should be of the following structural categories: framings, columns, walls, floors or foundations. The first of given elements is set as the primary one.
Create(Document, IList<ElementId>, ElementId)
 Creates a new instance of a Structural Connection Handler, which defines the connection between given elements. Elements should be of the following structural categories: framings, columns, walls, floors or foundations. The first of given elements is set as primary one.
Create(Document, IList<ElementId>, String)
 Creates custom StructuralConnectionHandlerType and StructuralConnectionHandler.
See Also
StructuralConnectionHandler Class
StructuralConnectionHandler Members
Autodesk.Revit.DB.Structure Namespace